{
    "bio": "But I must explain to you how all this mistaken idea of denouncing pleasure and praising pain was born and I will give you a complete account of the system, and expound the actual teachings of the great explorer of the truth, the master-builder of human happiness. No one rejects, dislikes, or avoids pleasure itself, because it is pleasure, but because those who do not know how to pursue pleasure rationally encounter consequences that are extremely painful. Nor again is there anyone who loves or pursues or desires to obtain pain of itself, because it is pain, but because occasionally circumstances occur in which toil and pain can procure him some great pleasure. To take a trivial example, which of us ever undertakes laborious physical exercise, except to obtain some advantage from it? But who has any right to find fault with a man who chooses to enjoy a pleasure that has no annoying consequences, or one who avoids a pain that produces no resultant pleasure? But I must explain to you how all this mistaken idea of denouncing pleasure and praising pain was born and I will give you a complete account of the system, and expound the actual teachings of the great explorer of the truth, the master-builder of human happiness. No one rejects, dislikes, or avoids pleasure itself, because it is pleasure, but because those who do not know how to pursue pleasure rationally encounter consequences that are extremely painful. Nor again is there anyone who loves or pursues or desires to obtain pain of itself, because it is pain, but because occasionally circumstances occur in which toil and pain can procure him some great pleasure. To take a trivial example, which of us ever undertakes laborious physical exercise, except to obtain some advantage from it? But who has any right to find fault with a man who chooses to enjoy a pleasure that has no annoying consequences, or one who avoids a pain that produces no resultant pleasure?",
    "experience":{
        "p":"He desarrollado proyectos académicos y personales (como esta página). Sin embargo, subo todo lo que hago a Github (<a href='http://github.com/MarksASP95'>MarksASP95</a>). <br /> Estos son mis proyectos favoritos:",
        "projects":[{
            "title":"Maze Generator",
            "language":"[Java]",
            "description":"Su nombre lo describe muy bien. Crea laberintos de forma aleatoria utilizando el Algoritmo Aldous-Broder.",
            "imgSrc":"img/maze.PNG",
            "imgAlt":"maze",
            "url":"https://github.com/MarksASP95/maze-generator-java"
        },
        {
            "title":"Match Simulator",
            "language":"[Javascript]",
            "description":"Simula partidos de futbol utilizando el algoritmo Soccer Decoder, hecho por Alessandro Ferrarini. Este demo se conventirá en una simulación del mundial de Rusia 2018.",
            "imgSrc":"img/soccer.JPG",
            "imgAlt":"soccer",
            "url":"https://github.com/MarksASP95/match_sim"
        },
        {
            "title":"Build BST",
            "language":"[Java]",
            "description":"Toma una expresión matemática y la muestra en un Árbol Binario de Búsqueda.",
            "imgSrc":"img/tree.PNG",
            "imgAlt":"bst",
            "url":"https://github.com/MarksASP95/buildBST"
        },
        {
            "title":"Mochila",
            "language":"[CSS]",
            "description":"Front End para un proyecto que está siendo desarrollado por mi y colegas de Free Code Camp.",
            "imgSrc":"img/mochila.JPG",
            "imgAlt":"mochila",
            "url":"https://github.com/MarksASP95/Mochila-FCC"
        },
        {
            "title":"iOS Calculator",
            "language":"[ReactJS]",
            "description":"Simulación de una calculadora de iOS.",
            "imgSrc":"img/ios-calc.PNG",
            "imgAlt":"ios-calc",
            "url":"https://ios-calc-masp.surge.sh"
        }]
    },
    "skills":[
        {
            "skillType":"Front End",
            "skillList":[
                {"imgSrc":"img/skills/html5.png","imgAlt":"html5","figCaption":"HTML5"},
                {"imgSrc":"img/skills/css3.png","imgAlt":"css3","figCaption":"CSS3"},
                {"imgSrc":"img/skills/js1.png","imgAlt":"js","figCaption":"Javacript"},
                {"imgSrc":"img/skills/reactjs.png","imgAlt":"reactjs","figCaption":"ReactJS"},
                {"imgSrc":"img/skills/bootstrap.png","imgAlt":"bootstrap","figCaption":"Bootstrap"}
            ]
        },
        {
            "skillType":"Back End",
            "skillList":[
                {"imgSrc":"img/skills/php.png","imgAlt":"php","figCaption":"PHP"},
                {"imgSrc":"img/skills/nodejs.png","imgAlt":"nodejs","figCaption":"NodeJS"}
            ]
        },
        {
            "skillType":"Bases de datos",
            "skillList":[
                {"imgSrc":"img/skills/sql.png","imgAlt":"sql","figCaption":"SQL"}
            ]
        },
        {
            "skillType":"Aplicaciones de escritorio",
            "skillList":[
                {"imgSrc":"img/skills/java.png","imgAlt":"java","figCaption":"Java"},
                {"imgSrc":"img/skills/vb.png","imgAlt":"visual_basic","figCaption":"Visual Basic"}
            ]
        }
    ]
    
}
